# GetAllMaterials Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationConfiguration..::..GetAllMaterials Method
FabricationConfiguration Class See Also
---
Gets all material identifiers in the fabrication configuration.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public IList<int> GetAllMaterials(
	FabricationPart part
)
```

Visual Basic
---
```text
Public Function GetAllMaterials ( _
	part As FabricationPart _
) As IList(Of Integer)
```

Visual C++
---
```text
public:
IList<int>^ GetAllMaterials(
	FabricationPart^ part
)
```

# ### Parameters
part
    Type: Autodesk.Revit.DB..::..FabricationPart The fabrication part.
# ### Return Value
An array of material identifiers.
# Remarks
If a part is passed, only returns materials which are valid for the part, otherwise returns all materials.
# See Also
FabricationConfiguration Class
Autodesk.Revit.DB Namespace